import 'package:flutter/material.dart';
import 'package:flutter_items/components/game_item.dart';
import 'package:flutter_items/models/game.dart';

final List<Game> games = [
  Game(
      "1727088258",
      "Elden Ring",
      '''Золотой порядок сломлен

Восстань, погасшая душа! Междуземье ждёт своего повелителя. Пусть благодать приведёт тебя к Кольцу Элден.

ELDEN RING — ролевая игра в жанре фэнтези от FromSoftware Inc. и BANDAI NAMCO Entertainment Inc. и на сегодняшний день — самый масштабный проект FromSoftware, действие которого разворачивается в мире, полном тайн и опасностей.

В Междуземье, владении королевы Марики Бессмертной, разбилось великое Кольцо Элден — источник силы Древа Эрд. Вскоре отпрыски Марики, полубоги, завладели осколками Кольца Элден — великими рунами. Однако обретённая сила развратила детей королевы, и они развязали войну — Раскол. И отреклась от них Великая Воля.

Теперь же благодать ведёт Погасших, лишённых золотой милости и изгнанных из Междуземья. Живые мертвецы, давным-давно утратившие благодать, отправляйтесь в Междуземье через туманное море и предстаньте перед Кольцом Элден.

 

Ибо оно ждёт нового повелителя''',
      "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Fi.ytimg.com%2Fvi%2FE3Huy2cdih0%2Fmaxresdefault.jpg&f=1&nofb=1&ipt=8c93c275775a5bdd9a93c346d13054bddb4f5c24b20f51eedd3198dce5ad440e&ipo=images",
      "2519 руб.",
      ),
      Game(
        "1727108578",
        "Zonles Zone Zero",
        '''Добро пожаловать в Нью-Эриду — место, где возрождается человечество!

Не ходи в каверны.
Ну да, ну да: там эфирные ресурсы, невиданные артефакты, сокровища старой цивилизации — огромные богатства, в общем. Я в курсе.
А как насчёт того, что пространство там хаотично искажается, монстры готовы тебя на куски разорвать, а если не разорвут, так ты и без них мутируешь? Да и вообще, каверны ведь чуть было не уничтожили наш мир! Не надо туда ходить нормальным людям.
Вот и не ходи.
Ну хотя бы в одиночку не ходи.
Если уж ищешь себе проблем на разные места, иди сначала в Нью-Эриду.
В этом сумасшедшем муравейнике как раз полно типов, которые без каверн жить не могут. Всякие там богачи, уличные банды, психи-заговорщики, ну и чиновники с дыроколом вместо сердца.
В общем, есть там где подготовиться, найти товарищей для похода. Ах да, самое-то главное —
найди себе прокси!
Без прокси ты из каверны не выберешься, так и будешь блуждать до смерти.
Ладно, удачи.

В Zenless Zone Zero, новой экшен 3D-игре от HoYoverse, события разворачиваются в недалёком будущем, в мире, раздираемом загадочными природными катастрофами — кавернами.
Две личности, одна судьба

В недалёком будущем произошла катастрофа: тут и там начали появляться загадочные «каверны». На обломках раздираемого бедствиями мира вырос новый город — Нью-Эриду, последний бастион цивилизации: беспорядочный, шумный, опасный, но полный жизни. Жители Нью-Эриду создали технологии, позволяющие сосуществовать с кавернами и пользоваться заключённой в них противоречивой силой. Вам предстоит выступить в роли «прокси», одного из немногих проводников, связывающих город с кавернами. Как сложится судьба вашего героя?
Стремительные сражения рука об руку с товарищами

В Zenless Zone Zero, новой экшен 3D-игре от HoYoverse, вы можете насладиться сражениями сполна. В бою участвует отряд из трёх человек. Каждый боец использует базовую и особую атаку, может уклоняться от ударов врагов, блокировать их и, в свою очередь, оглушать врага. По оглушённому врагу можно выполнить цепочку атак — зрелищное смертоносное комбо. Чтобы одержать победу, в бою нужно использовать уязвимости врага — а они у каждого врага разные.
Уникальные атмосферные саундтреки

Zenless Zone Zero обладает своеобразным художественным стилем и визуальным дизайном. Точно переданные эмоции персонажей, реалистичные движения — всё это погружает вас в полный лёгкого юмора сюжет и заставляет поверить в разворачивающуюся эпическую историю. Ну и как же такой истории без саундтрека! Все незабываемые моменты вашего приключения в Нью-Эриду будет сопровождать с любовью созданная музыка!
Неожиданные встречи с агентами из различных фракций

Как видеопрокату Random Play не обойтись без видеокассет, так и прокси — без агентов. Нью-Эриду — такой город, где вам всегда могут постучать в дверь, когда вы меньше всего этого ждёте. И не дайте внешности гостя обмануть вас: очаровательная и невинная девушка может обвести вас вокруг пальца, громила может оказаться милейшим человеком, а самым страшным в мохнатом полузвере может быть его линяющая шерсть. Постарайтесь подружиться с каждым, познакомьтесь с их яркими личностями и заручитесь их поддержкой — в конце концов, вас ждёт долгий путь, и на нём без верных друзей не обойтись.''',
        "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftwinfinite.net%2Fwp-content%2Fuploads%2F2022%2F09%2FZenless-Zone-Zero.jpg&f=1&nofb=1&ipt=5d4621685580a4ef892017b7d8625ed58360eaa061d597b40bc234e7c82f9929&ipo=images",
        "100 руб.",
      )
];

class HomePage extends StatelessWidget {
  const HomePage({super.key});
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        appBar: AppBar(
          centerTitle: true,
          title: const Text("Каталог игр", style: TextStyle(fontWeight: FontWeight.bold),),
        ),
        body: Padding(
            padding: const EdgeInsets.all(8.0),
            child: GridView.builder(
                gridDelegate: const SliverGridDelegateWithMaxCrossAxisExtent(
                    maxCrossAxisExtent: 200,
                    childAspectRatio: 6 / 12,
                    crossAxisSpacing: 20,
                    mainAxisSpacing: 20),
                itemCount: games.length,
                itemBuilder: (BuildContext ctx, index) {
                  return GameItem(game: games[index]);
                })));
  }
}
